{
  "header": {
    "title": "Portfolio",
    "home": "Home",
    "experience": "Experience",
    "about": "About Me",
    "projects": "Projects",
    "contact": "Contact"
  },
  "status": {
    "title": "Status",
    "content": "Currently seeking challenging opportunities to continue expanding my skills, committed to learning new technologies and frameworks."
  },
  "hobbies": {
    "content": " I enjoy video games, researching and watching new technological trends in the gaming world and in the future creating my own video game, cooking, reading and exercising."
  },
  "skills": {
    "content": "As a software developer, my technical knowledge is based on a wide range of tools, languages, and frameworks that allow me to bring digital solutions to life."
  },
  "intro":{
      "imageTitle": "If I must fall, I will rise each time a better man.",
  "developer":"Developer",
  "part1":" With over 2 years of experience.",
  "part2":" Full-Stack Developer, Backend and Augmented Reality Apps.",
  "part3":" I enjoy facing new challenges, working on multidisciplinary projects to add value through technology and provide creative solutions that not only solve problems efficiently but also generate strategic value in the long term."
  },
  "badge":{
    "title":"Available for work"
  },
  "certificate":
  {
    "title":"Certificates"
  },
  "contact":{
    "email":"Your email address",
    "placeholderemail":"name@company.com",
    "name":"Name",
    "placeholdername":"What is your name?",
    "subject":"Subject",
    "placeholdersubject":"What is your message about?",
    "message":"Your message",
    "placeholdermessage":"Write your message here",
    "send":"Send message",
    "option":"Or send me a message to"
  },
  "dropdown":{
    "cv":"Resume"
  },
  "education":{
    "title":"Education",
    "fimedatedip":"October 2025 - Present",
    "fimetitledip": "MASTER'S DEGREE IN SOFTWARE ENGINEERING AND COMPUTER SYSTEMS",
    "fimetitle":"SOFTWARE THE TECHNOLOGY IN ENGINEER (TITLED)",
    "eiao": "TECHNICAL BACHELOR IN WEB PROGRAMMING"
  },
  
  
  "experience": [
    {
        "title": "Trainee consultant",
        "date": "October 2025 - Present",
        "description": [
          "- Development of classes, interfaces, controllers, methods, and programming logic in C#.",
        "- Modifications to OLAP cubes, views, dimensions, and table relationships.",
        "- Participation in code reviews and testing to ensure software quality.",
        "- Version control and team collaboration using GitHub."

      
    ]
        
      },
      {
        "title": "Systems Engineer",
        "date": "March 2025 - August 2025",
        "description": [
          "- DMS support in the management and resolution of technical incidents.",
      "- Support for the Systems Department in creating users and modifying permissions.",
      "- Maintenance of LAN and WAN servers.",
      "- Performing software updates and monitoring server performance.",
      "- Collaboration with internal teams to improve system efficiency."
        ]
      },
      {
        "title": "Developer / Project Management",
        "date": "December 2022 - March 2025",
        "description": [
          "- I improved project management using agile methodologies, which made production more efficient.",
        "- Collaboration on projects presented in their main entry and on their official website.",
        "- I led the creation of Virtual Reality environments with Unity.",
        "- Project management based on agile methodologies (specializing in Scrum).",
        "- Installation of servers, hardware, and software on workstations."
        ]
      },
    
      {
        "title": "General Assistant",
        "date":"December 2014 - July 2015",
        "description": [
          "- IT maintenance, ensuring systems run smoothly and minimizing user downtime. ",
          "- Report generation with SAP and manipulation of pivot tables."
        ]
      }    
    ],

  "footer": {
            "content":"This page was built with Astro",
            "source":" Source Code"
  },
  "languages": {
    "languages": "Languages"
  },
  "personalskills": {
    "title": "Personal Skills",
    "time": "Time Management",
    "timecontent": "Ability to organize and prioritize tasks efficiently", 
    
    "team": "Teamwork",
    "teamcontent": "Ability to work as a team, collaborate and communicate effectively",
    "problem": "Problem Solving",
    "problemcontent": "Ability to identify and solve problems in a creative way",
    "comunication": "Communication",
    "comunicationcontent": "Ability to express ideas, concepts in a clear and effective manner.",
    "proactive": "Proactivity",
    "proactivecontent": "I am proactive and always look for opportunities to improve and contribute.",
    "empathy": "Empathy",
    "empathycontent": "Understanding the needs and perspectives of others."
  },
  "project": [
    {
      "description": 
      "Browse the facilities of the Faculty of Engineering, get to know the departments and get a feel for the academic environment from the comfort of your screen."
    },
    { 
        "description": 
  "Simple, intuitive and powerful app for planning, recording, and tracking your workouts with built-in AI chat to generate routines."
  },
  {
    "description":
"Interactive web Pokedex with a retro design that allows you to search, filter and explore information about Pokémon, as well as export data to Excel and send by mail."
},
   { 
        "description": 
  "Website offering electrical services and electrical installations with integrated stripe payment gateway, product details etc."
  },
      
  {
    "description": 
  "Forklift simulator in Unity, aiming to teach operators how to drive a forklift safely, fully functional with steering wheel, pedals, shifter and VR."
  },

    { 
      "description": 
  "Payroll management system, control the employees through a database, create, delete, their attendances, with overtime calculation, bonuses, discounts, etc and at the end of the month generate their payrolls."
  },
    { 
      "description": 
  "2D spaceship game, inspired by the Space Invaders video game with the possibility to choose between 4 levels of difficulty, with Score and lives."
  },
 
    { 
      "description": 
  "Mobile application created in Android Studios to scan walls and get the color of the wall, with the possibility to save the colors, photo and view them in the gallery."
  }

  ],
  
    "projectinfo":{
      "project":"View project",
      "code":"View code",
      "video":"View video"
    },
    "skillsmenu":{
      "skills":"Skills",
      "languages":"Programming Languages",
    "toolstec":"Technical Tools",
    "pskills":"Personal skills"
    },
    "toolstec": {
      "toolstec": "Technical Tools"
    },
    "index":{
      "experience": "Work Experience",
      "project": "Projects",
      "education": "Education",
      "about": "About Me",
      "contact": "Contact"
    }

}



