{
  "header": {
    "title": "Portafolio",
    "home": "Inicio",
    "experience": "Experiencia",
    "about": "Sobre mí",
    "projects": "Proyectos",
    "contact": "Contacto"
  },
  "status": {
    "title": "Estatus",
    "content": "Actualmente en busca de oportunidades desafiantes para continuar expandiendo mis habilidades, comprometido con el aprendizaje de nuevas tecnologías y marcos."
  },
  "hobbies": {
    "content": " Disfruto de los videojuegos, investigar y ver las nuevas tendencias tecnológicas en el mundo del gaming y en un futuro crear mi propio videojuego, cocinar, la lectura y hacer ejercicio."
  },
  "skills": {
    "content": "Como desarrollador de software, mis conocimientos técnicos se basan en una amplia gama de herramientas, lenguajes y marcos de trabajo que me permiten dar vida a soluciones digitales."
  },
  "intro":{
      "imageTitle": "Si debo caer, me levantaré cada vez como un hombre mejor",
  "developer":"Desarrollador",
  "part1":" Con más de 2 años de experiencia.",
  "part2":" Desarrollador en Full-Stack, Backend y en Apps Realidad Aumentada.",
  "part3":" Disfruto enfrentar nuevos retos, trabajar en proyectos multidisciplinarios para aportar valor a través de la tecnología y aportar soluciones creativas que no solo resuelvan problemas de manera eficiente, sino que también generen valor estratégico a largo plazo."
  },
  "badge":{
    "title":"Disponible para trabajar"
  },
  "certificate":
  {
    "title":"Certificados"
  },
  "contact":{
    "email":"Tu correo electrónico",
    "placeholderemail":"nombre@compañia.com",
    "name":"Nombre",
    "placeholdername":"¿Cual es tu nombre?",
    "subject":"Asunto",
    "placeholdersubject":"¿De qué se trata tu mensaje?",
    "message":"Tu mensaje",
    "placeholdermessage":"Escribe tu mensaje aquí",
    "send":"Enviar mensaje",
    "option":"O envíeme un mensaje a"
  },
  "dropdown":{
    "cv":"Curriculum"
  },
  "education":{
    "title":"Educación",
    "fimedatedip":"Enero - Marzo 2024",
    "fimetitledip": "DIPLOMADO EN PYTHON EN INTERFACES GRÁFICAS Y ANÁLISIS",
    "fimetitle":"INGENIERO EN TECNOLOGÍA DE SOFTWARE (TITULADO)",
    "eiao": "BACHILLER TÉCNICO EN PROGRAMACIÓN WEB"
  },
"experience": [
  {
    "title": "Ingeniero en Sistemas",
    "date": "Marzo 2025 - Presente",
    "description": [
      "-Soporte DMS a usuarios finales y concesionarias a nivel nacional.",
"-Apoyo al Departamento de Sistemas en creación de usuarios, modificación de permisos, asignación.",
"-Seguimiento de tickets"
    ]
  },
    {
      "title": "Desarrollador / Gestión de Proyectos",
      "date": "Diciembre 2022 - Marzo 2025",
      "description": [
        "- Creación de entornos en Realidad Virtual(Unity) (Simulador de Montacargas, Python Horror, Recorrido FIME Unity/Web).",
        "- Administración de proyectos basados en metodologías ágiles (especializado en Scrum)."
      ]
    },
    {
      "title": "Ayudante General",
      "date":"Diciembre 2014 - Julio 2015",
      "description": [
         "- Mantenimiento de computadoras. ",
         "- Generación de informes con SAP y manipulación de tablas dinámicas. "
      ]
    }
  ],
  
    "footer": {
      "content": "Esta página fue construida con Astro",
      "source": " Codigo Fuente"
  },
  "languages": {
    "languages": "Lenguajes"
  },
  "personalskills": {
    "title": "Habilidades Personales",
    "time": "Gestión del Tiempo",
    "timecontent": "Capacidad para organizar y priorizar tareas eficientemente.",
    "team": "Trabajo en Equipo",
    "teamcontent": "Habilidad para trabajar en equipo, colaborar y comunicarse efectivamente.",
    "problem": "Resolución de Problemas",
    "problemcontent": "Habilidad para identificar y resolver problemas de manera creativa.",
    "comunication": "Comunicación",
    "comunicationcontent": "Capacidad para expresar ideas, conceptos de manera clara y efectiva.",
    "proactive": "Proactividad",
    "proactivecontent": "Soy proactivo y siempre busco oportunidades para mejorar y contribuir.",
    "empathy": "Empatía",
    "empathycontent": "Comprensión de las necesidades y perspectivas de otros."
  },
  
"project": [
  {
    "description": 
    "Navega por las instalaciones de la Facultad de Ingeniería, conoce los departamentos y hazte una idea del ambiente académico desde la comodidad de tu pantalla."
  },
  {
    "description": 
"Aplicacion sencilla, intuitiva y potente para planificar, registrar y realizar un seguimiento de sus entrenamientos."
},
{
    "description": 
"Pagina Web donde se ofrecen servicios electricos e instalaciones electricas con pasarela de pagos stripe integrada, destalles de el product etc."
},
{
  "description": 
"Simulador de montacargas en Unity, con el objetivo de enseñar a los operadores a manejar un montacargas de manera segura, completamente funcional con volante, pedales, palanca de cambios y VR."
},
{
  "description": 
"Sistema de gestion de nomina, controlar los empleados por medio de una base de datos, crear, borrar, sus asistencias, con calculo de horas extras, bonos, descuentos, etc y al final del mes generar sus nominas."
},
{
  "description": 
"Juego de naves en 2D, inspírado en el videojuego Space Invaders con la posibilidad de elegir entre 4 niveles de dificultad, con Score y vidas."
},
{
  "description": 
"Aplicacion movil creada en Android Studios para escanear paredes y obtener el color de la misma, con la posibilidad de guardar los colores, foto y verlos en la galeria."
}

],

  "projectinfo":{
    "project":"Ver proyecto",
    "code":"Ver código",
    "video":"Ver video"
  },
  "skillsmenu":{
    "skills":"Habilidades",
    "languages":"Lenguajes de Programación",
    "toolstec":"Herramientas Tecnicas",
    "pskills":"Habilidades personales"
  },
  "toolstec": {
    "toolstec": "Herramientas Tecnicas"
  },
  "index":{
    "experience":"Experiencia Laboral",
    "project":"Proyectos",
    "education":"Educación",
    "about":"Sobre mí",
    "contact":"Contacto"
  }
}

